Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ1024EFF064.atdf
      <value-group caption="Propagation Time Segment bits" name="C1CFG__PRSEG">
         <value caption="Length is 8 x Tq" name="" value="0x7"/>
         <value caption="Length is 1 x Tq" name="" value="0x0"/>
      </value-group>
      <value-group caption="Phase Buffer Segment 1 bits" name="C1CFG__SEG1PH">
         <value caption="Length is 8 x Tq" name="" value="0x7"/>
         <value caption="Length is 1 x Tq" name="" value="0x0"/>
      </value-group>
      <value-group caption="Sample of the CAN Bus Line bit" name="C1CFG__SAM">
         <value caption="Bus line is sampled three times at the sample point" name="" value="0x1"/>
         <value caption="Bus line is sampled once at the sample point" name="" value="0x0"/>
      </value-group>
      <value-group caption="Phase Segment 2 Time Select bit" name="C1CFG__SEG2PHTS">
         <value caption="Freely programmable" name="" value="0x1"/>
         <value caption="Maximum of SEG1PH or Information Processing Time" name="" value="0x0"/>
      </value-group>
      <value-group caption="Phase Buffer Segment 2 bits" name="C1CFG__SEG2PH">
         <value caption="Length is 8 x Tq" name="" value="0x7"/>
         <value caption="Length is 1 x Tq" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Bus Line Filter Enable bit" name="C1CFG__WAKFIL">
         <value caption="Use CAN bus line filter for wake-up" name="" value="0x1"/>
         <value caption="CAN bus line filter is not used for wake-up" name="" value="0x0"/>
      </value-group>
      <value-group caption="Baud Rate Prescaler bits" name="C2CFG__BRP">
         <value caption="Tq = (2 x 64)/Tpbclk5" name="" value="0x3f"/>
         <value caption="Tq = (2 x 63)/Tpbclk5" name="" value="0x3e"/>
         <value caption="Tq = (2 x 2)/Tpbclk5" name="" value="0x1"/>
         <value caption="Tq = (2 x 1)/Tpbclk5" name="" value="0x0"/>
      </value-group>
      <value-group caption="Synchronization Jump Width bits" name="C2CFG__SJW">
         <value caption="Length is 4 x Tq" name="" value="0x3"/>
         <value caption="Length is 3 x Tq" name="" value="0x2"/>
         <value caption="Length is 2 x Tq" name="" value="0x1"/>
         <value caption="Length is 1 x Tq" name="" value="0x0"/>
      </value-group>
      <value-group caption="Propagation Time Segment bits" name="C2CFG__PRSEG">
         <value caption="Length is 8 x Tq" name="" value="0x7"/>
         <value caption="Length is 1 x Tq" name="" value="0x0"/>
      </value-group>
      <value-group caption="Phase Buffer Segment 1 bits" name="C2CFG__SEG1PH">
         <value caption="Length is 8 x Tq" name="" value="0x7"/>
         <value caption="Length is 1 x Tq" name="" value="0x0"/>
      </value-group>
      <value-group caption="Sample of the CAN Bus Line bit" name="C2CFG__SAM">
         <value caption="Bus line is sampled three times at the sample point" name="" value="0x1"/>
         <value caption="Bus line is sampled once at the sample point" name="" value="0x0"/>
      </value-group>
      <value-group caption="Phase Segment 2 Time Select bit" name="C2CFG__SEG2PHTS">
         <value caption="Freely programmable" name="" value="0x1"/>
         <value caption="Maximum of SEG1PH or Information Processing Time" name="" value="0x0"/>
      </value-group>
      <value-group caption="Phase Buffer Segment 2 bits" name="C2CFG__SEG2PH">
         <value caption="Length is 8 x Tq" name="" value="0x7"/>
         <value caption="Length is 1 x Tq" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Bus Line Filter Enable bit" name="C2CFG__WAKFIL">
         <value caption="Use CAN bus line filter for wake-up" name="" value="0x1"/>
         <value caption="CAN bus line filter is not used for wake-up" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transmit Buffer Interrupt Flag bit" name="C1INT__TBIF">
         <value caption="A transmit buffer interrupt is pending" name="" value="0x1"/>
         <value caption="A transmit buffer interrupt is not pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Buffer Interrupt Flag bit" name="C1INT__RBIF">
         <value caption="A receive buffer interrupt is pending" name="" value="0x1"/>
         <value caption="A receive buffer interrupt is not pending" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Timer Overflow Interrupt Flag bit" name="C1INT__CTMRIF">
         <value caption="A CAN timer (CANTMR) overflow has occurred" name="" value="0x1"/>
         <value caption="A CAN timer (CANTMR) overflow has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Mode Change Interrupt Flag bit" name="C1INT__MODIF">
         <value caption="A CAN module mode change has occurred (OPMOD has changed to reflect REQOP)" name="" value="0x1"/>
         <value caption="A CAN module mode change has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Receive Buffer Overflow Interrupt Flag bit" name="C1INT__RBOVIF">
         <value caption="A receive buffer overflow has occurred" name="" value="0x1"/>
         <value caption="A receive buffer overflow has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="System Error Interrupt Flag bit" name="C1INT__SERRIF">
         <value caption="A system error occurred (typically an illegal address was presented to the System Bus)" name="" value="0x1"/>
         <value caption="A system error has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Bus Error Interrupt Flag bit" name="C1INT__CERRIF">
         <value caption="A CAN bus error has occurred" name="" value="0x1"/>
         <value caption="A CAN bus error has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="CAN Bus Activity Wake-up Interrupt Flag bit" name="C1INT__WAKIF">
         <value caption="A bus wake-up activity interrupt has occurred" name="" value="0x1"/>
         <value caption="A bus wake-up activity interrupt has not occurred" name="" value="0x0"/>
      </value-group>
      <value-group caption="Invalid Message Received Interrupt Flag bit" name="C1INT__IVRIF">
         <value caption="An invalid messages interrupt has occurred" name="" value="0x1"/>
         <value caption="An invalid message interrupt has not occurred" name="" value="0x0"/>
      </value-group>
