Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ1024EFF064.atdf
      <value-group caption="Message Transmit Priority bits" name="C1FIFOCON30__TXPRI">
         <value caption="Highest Message Priority" name="" value="0x3"/>
         <value caption="High Intermediate Message Priority" name="" value="0x2"/>
         <value caption="Low Intermediate Message Priority" name="" value="0x1"/>
         <value caption="Lowest Message Priority" name="" value="0x0"/>
      </value-group>
      <value-group caption="Auto RTR Enable bit" name="C1FIFOCON30__RTREN">
         <value caption="When a remote transmit is received, TXREQ will be set" name="" value="0x1"/>
         <value caption="When a remote transmit is received, TXREQ will be unaffected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Message Send Request" name="C1FIFOCON30__TXREQ">
         <value caption="1: (FIFO configured as a Transmit FIFO) Setting this bit to 1 requests sending a message. The bit will automatically clear when all the messages queued in the FIFO are successfully sent. Clearing the bit to 0 while set (1) will request a message abort." name="" value="0x0"/>
         <value caption="0: (FIFO configured as a Receive FIFO) This bit has no effect." name="" value="0x0"/>
      </value-group>
      <value-group caption="Error Detected During Transmission bit(3)" name="C1FIFOCON30__TXERR">
         <value caption="A bus error occurred while the message was being sent" name="" value="0x1"/>
         <value caption="A bus error did not occur while the message was being sent" name="" value="0x0"/>
      </value-group>
      <value-group caption="Message Lost Arbitration bit(3)" name="C1FIFOCON30__TXLARB">
         <value caption="Message lost arbitration while being sent" name="" value="0x1"/>
         <value caption="Message did not lose arbitration while being sent" name="" value="0x0"/>
      </value-group>
      <value-group caption="Message Aborted bit(2)" name="C1FIFOCON30__TXABAT">
         <value caption="Message was aborted" name="" value="0x1"/>
         <value caption="Message completed successfully" name="" value="0x0"/>
      </value-group>
      <value-group caption="TX/RX Buffer Selection bit" name="C1FIFOCON30__TXEN">
         <value caption="FIFO is a Transmit FIFO" name="" value="0x1"/>
         <value caption="FIFO is a Receive FIFO" name="" value="0x0"/>
      </value-group>
      <value-group caption="Store Message Data Only bit(1)" name="C1FIFOCON30__DONLY">
         <value caption="1: (FIFO configured as a Transmit FIFO) This bit is not used and has no effect. " name="" value="0x0"/>
         <value caption="0: (FIFO configured as a Receive FIFO) 1 = Only data bytes will be stored in the FIFO, 0 = Full message is stored, including identifier" name="" value="0x0"/>
      </value-group>
      <value-group caption="Increment Head/Tail bit" name="C1FIFOCON30__UINC">
         <value caption="1: (FIFO configured as a Transmit FIFO) When this bit is set, the FIFO head will increment by a single message" name="" value="0x0"/>
         <value caption="0: (FIFO configured as a Receive FIFO) When this bit is set, the FIFO tail will increment by a single message" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Reset bits" name="C1FIFOCON30__FRESET">
         <value caption="FIFO will be reset when bit is set, cleared by hardware when FIFO is reset. After setting, the user application should poll whether this bit is clear before taking any action" name="" value="0x1"/>
         <value caption="No effect" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Size bits(1)" name="C1FIFOCON30__FSIZE">
         <value caption="FIFO is 32 messages deep" name="" value="0x1f"/>
         <value caption="FIFO is 3 messages deep" name="" value="0x2"/>
         <value caption="FIFO is 2 messages deep" name="" value="0x1"/>
         <value caption="FIFO is 1 message deep" name="" value="0x0"/>
      </value-group>
      <value-group caption="Message Transmit Priority bits" name="C2FIFOCON30__TXPRI">
         <value caption="Highest Message Priority" name="" value="0x3"/>
         <value caption="High Intermediate Message Priority" name="" value="0x2"/>
         <value caption="Low Intermediate Message Priority" name="" value="0x1"/>
         <value caption="Lowest Message Priority" name="" value="0x0"/>
      </value-group>
      <value-group caption="Auto RTR Enable bit" name="C2FIFOCON30__RTREN">
         <value caption="When a remote transmit is received, TXREQ will be set" name="" value="0x1"/>
         <value caption="When a remote transmit is received, TXREQ will be unaffected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Message Send Request" name="C2FIFOCON30__TXREQ">
         <value caption="1: (FIFO configured as a Transmit FIFO) Setting this bit to 1 requests sending a message. The bit will automatically clear when all the messages queued in the FIFO are successfully sent. Clearing the bit to 0 while set (1) will request a message abort." name="" value="0x0"/>
         <value caption="0: (FIFO configured as a Receive FIFO) This bit has no effect." name="" value="0x0"/>
      </value-group>
      <value-group caption="Error Detected During Transmission bit(3)" name="C2FIFOCON30__TXERR">
         <value caption="A bus error occurred while the message was being sent" name="" value="0x1"/>
         <value caption="A bus error did not occur while the message was being sent" name="" value="0x0"/>
      </value-group>
      <value-group caption="Message Lost Arbitration bit(3)" name="C2FIFOCON30__TXLARB">
         <value caption="Message lost arbitration while being sent" name="" value="0x1"/>
         <value caption="Message did not lose arbitration while being sent" name="" value="0x0"/>
      </value-group>
      <value-group caption="Message Aborted bit(2)" name="C2FIFOCON30__TXABAT">
         <value caption="Message was aborted" name="" value="0x1"/>
         <value caption="Message completed successfully" name="" value="0x0"/>
      </value-group>
      <value-group caption="TX/RX Buffer Selection bit" name="C2FIFOCON30__TXEN">
         <value caption="FIFO is a Transmit FIFO" name="" value="0x1"/>
         <value caption="FIFO is a Receive FIFO" name="" value="0x0"/>
      </value-group>
