Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ1024EFF064.atdf
      <value-group caption="RMII Speed bit" name="EMAC1SUPP__SPEEDRMII">
         <value caption="RMII is running at 100 Mbps" name="" value="0x1"/>
         <value caption="RMII is running at 10 Mbps" name="" value="0x0"/>
      </value-group>
      <value-group caption="Reset RMII Logic bit" name="EMAC1SUPP__RESETRMII">
         <value caption="Reset the MAC RMII module" name="" value="0x1"/>
         <value caption="Normal operation." name="" value="0x0"/>
      </value-group>
      <value-group caption="Shortcut PAUSE Quanta bit" name="EMAC1TEST__SHRTQNTA">
         <value caption="The MAC reduces the effective PAUSE Quanta from 64 byte-times to 1 byte-time" name="" value="0x1"/>
         <value caption="Normal operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Test PAUSE bit" name="EMAC1TEST__TESTPAUSE">
         <value caption="The MAC Control sub-layer will inhibit transmissions" name="" value="0x1"/>
         <value caption="Normal operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Test Backpressure bit" name="EMAC1TEST__TESTBP">
         <value caption="The MAC will assert backpressure on the link. Backpressure causes preamble to be transmitted" name="" value="0x1"/>
         <value caption="Normal operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Scan Increment bit" name="EMAC1MCFG__SCANINC">
         <value caption="The MII Management module will perform read cycles across a range of PHYs. The read cycles will start from address 1 through the value set in EMAC1MADR" name="" value="0x1"/>
         <value caption="Continuous reads of the same PHY" name="" value="0x0"/>
      </value-group>
      <value-group caption="Suppress Preamble bit" name="EMAC1MCFG__NOPRE">
         <value caption="The MII Management will perform read/write cycles without the 32-bit preamble field. Some PHYs support suppressed preamble" name="" value="0x1"/>
         <value caption="Normal read/write cycles are performed" name="" value="0x0"/>
      </value-group>
      <value-group caption="Test Reset MII Management bit" name="EMAC1MCFG__RESETMGMT">
         <value caption="Reset the MII Management module" name="" value="0x1"/>
         <value caption="Normal Operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="MII Management Read Command bit" name="EMAC1MCMD__READ">
         <value caption="The MII Management module will perform a single read cycle. The read data is returned in the EMAC1MRDD register" name="" value="0x1"/>
         <value caption="The MII Management module will perform a write cycle. The write data is taken from the EMAC1MWTD register" name="" value="0x0"/>
      </value-group>
      <value-group caption="MII Management Scan Mode bit" name="EMAC1MCMD__SCAN">
         <value caption="The MII Management module will perform read cycles continuously (for example" name="" value="0x1"/>
         <value caption="Normal Operation" name="" value="0x0"/>
      </value-group>
   </module>
   <module caption="" id="02467" name="GPIO" version="1">
      <register-group name="GPIO">
         <register caption="" name="ANSELB" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSB0"/>
            <bitfield mask="0x00000002" name="ANSB1"/>
            <bitfield mask="0x00000004" name="ANSB2"/>
            <bitfield mask="0x00000008" name="ANSB3"/>
            <bitfield mask="0x00000010" name="ANSB4"/>
            <bitfield mask="0x00000020" name="ANSB5"/>
            <bitfield mask="0x00000040" name="ANSB6"/>
            <bitfield mask="0x00000080" name="ANSB7"/>
            <bitfield mask="0x00000100" name="ANSB8"/>
            <bitfield mask="0x00000200" name="ANSB9"/>
            <bitfield mask="0x00000400" name="ANSB10"/>
            <bitfield mask="0x00000800" name="ANSB11"/>
            <bitfield mask="0x00001000" name="ANSB12"/>
            <bitfield mask="0x00002000" name="ANSB13"/>
            <bitfield mask="0x00004000" name="ANSB14"/>
            <bitfield mask="0x00008000" name="ANSB15"/>
         </register>
         <register caption="" name="ANSELE" offset="0x300" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSE0"/>
            <bitfield mask="0x00000002" name="ANSE1"/>
            <bitfield mask="0x00000004" name="ANSE2"/>
            <bitfield mask="0x00000008" name="ANSE3"/>
            <bitfield mask="0x00000010" name="ANSE4"/>
            <bitfield mask="0x00000020" name="ANSE5"/>
            <bitfield mask="0x00000040" name="ANSE6"/>
            <bitfield mask="0x00000080" name="ANSE7"/>
            <bitfield mask="0x00000100" name="ANSE8"/>
            <bitfield mask="0x00000200" name="ANSE9"/>
            <bitfield mask="0x00000400" name="ANSE10"/>
            <bitfield mask="0x00000800" name="ANSE11"/>
            <bitfield mask="0x00001000" name="ANSE12"/>
            <bitfield mask="0x00002000" name="ANSE13"/>
            <bitfield mask="0x00004000" name="ANSE14"/>
            <bitfield mask="0x00008000" name="ANSE15"/>
         </register>
         <register caption="" name="ANSELG" offset="0x500" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ANSG0"/>
            <bitfield mask="0x00000002" name="ANSG1"/>
            <bitfield mask="0x00000004" name="ANSG2"/>
            <bitfield mask="0x00000008" name="ANSG3"/>
            <bitfield mask="0x00000010" name="ANSG4"/>
            <bitfield mask="0x00000020" name="ANSG5"/>
            <bitfield mask="0x00000040" name="ANSG6"/>
            <bitfield mask="0x00000080" name="ANSG7"/>
            <bitfield mask="0x00000100" name="ANSG8"/>
            <bitfield mask="0x00000200" name="ANSG9"/>
            <bitfield mask="0x00000400" name="ANSG10"/>
            <bitfield mask="0x00000800" name="ANSG11"/>
            <bitfield mask="0x00001000" name="ANSG12"/>
            <bitfield mask="0x00002000" name="ANSG13"/>
            <bitfield mask="0x00004000" name="ANSG14"/>
            <bitfield mask="0x00008000" name="ANSG15"/>
         </register>
         <register caption="" name="TRISB" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISB0"/>
            <bitfield mask="0x00000002" name="TRISB1"/>
            <bitfield mask="0x00000004" name="TRISB2"/>
            <bitfield mask="0x00000008" name="TRISB3"/>
            <bitfield mask="0x00000010" name="TRISB4"/>
            <bitfield mask="0x00000020" name="TRISB5"/>
            <bitfield mask="0x00000040" name="TRISB6"/>
            <bitfield mask="0x00000080" name="TRISB7"/>
            <bitfield mask="0x00000100" name="TRISB8"/>
            <bitfield mask="0x00000200" name="TRISB9"/>
            <bitfield mask="0x00000400" name="TRISB10"/>
            <bitfield mask="0x00000800" name="TRISB11"/>
            <bitfield mask="0x00001000" name="TRISB12"/>
            <bitfield mask="0x00002000" name="TRISB13"/>
            <bitfield mask="0x00004000" name="TRISB14"/>
            <bitfield mask="0x00008000" name="TRISB15"/>
         </register>
