Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/0.1/PIC32MZEF/atdf/PIC32MZ1024EFF064.atdf
         <register caption="" name="TRISC" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISC0"/>
            <bitfield mask="0x00000002" name="TRISC1"/>
            <bitfield mask="0x00000004" name="TRISC2"/>
            <bitfield mask="0x00000008" name="TRISC3"/>
            <bitfield mask="0x00000010" name="TRISC4"/>
            <bitfield mask="0x00000020" name="TRISC5"/>
            <bitfield mask="0x00000040" name="TRISC6"/>
            <bitfield mask="0x00000080" name="TRISC7"/>
            <bitfield mask="0x00000100" name="TRISC8"/>
            <bitfield mask="0x00000200" name="TRISC9"/>
            <bitfield mask="0x00000400" name="TRISC10"/>
            <bitfield mask="0x00000800" name="TRISC11"/>
            <bitfield mask="0x00001000" name="TRISC12"/>
            <bitfield mask="0x00002000" name="TRISC13"/>
            <bitfield mask="0x00004000" name="TRISC14"/>
            <bitfield mask="0x00008000" name="TRISC15"/>
         </register>
         <register caption="" name="TRISD" offset="0x210" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISD0"/>
            <bitfield mask="0x00000002" name="TRISD1"/>
            <bitfield mask="0x00000004" name="TRISD2"/>
            <bitfield mask="0x00000008" name="TRISD3"/>
            <bitfield mask="0x00000010" name="TRISD4"/>
            <bitfield mask="0x00000020" name="TRISD5"/>
            <bitfield mask="0x00000040" name="TRISD6"/>
            <bitfield mask="0x00000080" name="TRISD7"/>
            <bitfield mask="0x00000100" name="TRISD8"/>
            <bitfield mask="0x00000200" name="TRISD9"/>
            <bitfield mask="0x00000400" name="TRISD10"/>
            <bitfield mask="0x00000800" name="TRISD11"/>
            <bitfield mask="0x00001000" name="TRISD12"/>
            <bitfield mask="0x00002000" name="TRISD13"/>
            <bitfield mask="0x00004000" name="TRISD14"/>
            <bitfield mask="0x00008000" name="TRISD15"/>
         </register>
         <register caption="" name="TRISE" offset="0x310" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISE0"/>
            <bitfield mask="0x00000002" name="TRISE1"/>
            <bitfield mask="0x00000004" name="TRISE2"/>
            <bitfield mask="0x00000008" name="TRISE3"/>
            <bitfield mask="0x00000010" name="TRISE4"/>
            <bitfield mask="0x00000020" name="TRISE5"/>
            <bitfield mask="0x00000040" name="TRISE6"/>
            <bitfield mask="0x00000080" name="TRISE7"/>
            <bitfield mask="0x00000100" name="TRISE8"/>
            <bitfield mask="0x00000200" name="TRISE9"/>
            <bitfield mask="0x00000400" name="TRISE10"/>
            <bitfield mask="0x00000800" name="TRISE11"/>
            <bitfield mask="0x00001000" name="TRISE12"/>
            <bitfield mask="0x00002000" name="TRISE13"/>
            <bitfield mask="0x00004000" name="TRISE14"/>
            <bitfield mask="0x00008000" name="TRISE15"/>
         </register>
         <register caption="" name="TRISF" offset="0x410" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISF0"/>
            <bitfield mask="0x00000002" name="TRISF1"/>
            <bitfield mask="0x00000004" name="TRISF2"/>
            <bitfield mask="0x00000008" name="TRISF3"/>
            <bitfield mask="0x00000010" name="TRISF4"/>
            <bitfield mask="0x00000020" name="TRISF5"/>
            <bitfield mask="0x00000040" name="TRISF6"/>
            <bitfield mask="0x00000080" name="TRISF7"/>
            <bitfield mask="0x00000100" name="TRISF8"/>
            <bitfield mask="0x00000200" name="TRISF9"/>
            <bitfield mask="0x00000400" name="TRISF10"/>
            <bitfield mask="0x00000800" name="TRISF11"/>
            <bitfield mask="0x00001000" name="TRISF12"/>
            <bitfield mask="0x00002000" name="TRISF13"/>
            <bitfield mask="0x00004000" name="TRISF14"/>
            <bitfield mask="0x00008000" name="TRISF15"/>
         </register>
         <register caption="" name="TRISG" offset="0x510" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISG0"/>
            <bitfield mask="0x00000002" name="TRISG1"/>
            <bitfield mask="0x00000004" name="TRISG2"/>
            <bitfield mask="0x00000008" name="TRISG3"/>
            <bitfield mask="0x00000010" name="TRISG4"/>
            <bitfield mask="0x00000020" name="TRISG5"/>
            <bitfield mask="0x00000040" name="TRISG6"/>
            <bitfield mask="0x00000080" name="TRISG7"/>
            <bitfield mask="0x00000100" name="TRISG8"/>
            <bitfield mask="0x00000200" name="TRISG9"/>
            <bitfield mask="0x00000400" name="TRISG10"/>
            <bitfield mask="0x00000800" name="TRISG11"/>
            <bitfield mask="0x00001000" name="TRISG12"/>
            <bitfield mask="0x00002000" name="TRISG13"/>
            <bitfield mask="0x00004000" name="TRISG14"/>
            <bitfield mask="0x00008000" name="TRISG15"/>
         </register>
         <register caption="" name="PORTB" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RB0"/>
            <bitfield mask="0x00000002" name="RB1"/>
            <bitfield mask="0x00000004" name="RB2"/>
            <bitfield mask="0x00000008" name="RB3"/>
            <bitfield mask="0x00000010" name="RB4"/>
            <bitfield mask="0x00000020" name="RB5"/>
            <bitfield mask="0x00000040" name="RB6"/>
            <bitfield mask="0x00000080" name="RB7"/>
            <bitfield mask="0x00000100" name="RB8"/>
            <bitfield mask="0x00000200" name="RB9"/>
            <bitfield mask="0x00000400" name="RB10"/>
            <bitfield mask="0x00000800" name="RB11"/>
            <bitfield mask="0x00001000" name="RB12"/>
            <bitfield mask="0x00002000" name="RB13"/>
            <bitfield mask="0x00004000" name="RB14"/>
            <bitfield mask="0x00008000" name="RB15"/>
         </register>
         <register caption="" name="PORTC" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RC0"/>
            <bitfield mask="0x00000002" name="RC1"/>
            <bitfield mask="0x00000004" name="RC2"/>
            <bitfield mask="0x00000008" name="RC3"/>
            <bitfield mask="0x00000010" name="RC4"/>
            <bitfield mask="0x00000020" name="RC5"/>
            <bitfield mask="0x00000040" name="RC6"/>
            <bitfield mask="0x00000080" name="RC7"/>
            <bitfield mask="0x00000100" name="RC8"/>
            <bitfield mask="0x00000200" name="RC9"/>
            <bitfield mask="0x00000400" name="RC10"/>
            <bitfield mask="0x00000800" name="RC11"/>
            <bitfield mask="0x00001000" name="RC12"/>
            <bitfield mask="0x00002000" name="RC13"/>
            <bitfield mask="0x00004000" name="RC14"/>
            <bitfield mask="0x00008000" name="RC15"/>
         </register>
         <register caption="" name="PORTD" offset="0x220" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RD0"/>
            <bitfield mask="0x00000002" name="RD1"/>
            <bitfield mask="0x00000004" name="RD2"/>
            <bitfield mask="0x00000008" name="RD3"/>
            <bitfield mask="0x00000010" name="RD4"/>
            <bitfield mask="0x00000020" name="RD5"/>
            <bitfield mask="0x00000040" name="RD6"/>
            <bitfield mask="0x00000080" name="RD7"/>
            <bitfield mask="0x00000100" name="RD8"/>
            <bitfield mask="0x00000200" name="RD9"/>
            <bitfield mask="0x00000400" name="RD10"/>
            <bitfield mask="0x00000800" name="RD11"/>
            <bitfield mask="0x00001000" name="RD12"/>
            <bitfield mask="0x00002000" name="RD13"/>
            <bitfield mask="0x00004000" name="RD14"/>
            <bitfield mask="0x00008000" name="RD15"/>
         </register>
         <register caption="" name="PORTE" offset="0x320" rw="RW" size="4">
            <bitfield mask="0x00000001" name="RE0"/>
            <bitfield mask="0x00000002" name="RE1"/>
            <bitfield mask="0x00000004" name="RE2"/>
            <bitfield mask="0x00000008" name="RE3"/>
            <bitfield mask="0x00000010" name="RE4"/>
            <bitfield mask="0x00000020" name="RE5"/>
            <bitfield mask="0x00000040" name="RE6"/>
            <bitfield mask="0x00000080" name="RE7"/>
            <bitfield mask="0x00000100" name="RE8"/>
            <bitfield mask="0x00000200" name="RE9"/>
            <bitfield mask="0x00000400" name="RE10"/>
            <bitfield mask="0x00000800" name="RE11"/>
            <bitfield mask="0x00001000" name="RE12"/>
            <bitfield mask="0x00002000" name="RE13"/>
            <bitfield mask="0x00004000" name="RE14"/>
            <bitfield mask="0x00008000" name="RE15"/>
         </register>
